export default {
  // 显示所有小区列表
  getCourtList: config => {
    var data = []
    var condiArr = [
      [12606383.857709808, 2649797.467332422], // 广州
      [12661418.518075136, 2636956.046580512], // 东莞
      [12734798.065228906, 2646739.986201015], // 惠州
      [12518328.401125286, 2639402.0314856376], // 肇庆
      [12695662.306746894, 2578863.9050837783], // 深圳
      [12695663.306746894, 2578863.9050837783], // 南京
      [12695662.306746894, 2578863.9050837783], // 深圳
      [12695664.306746895, 2578863.9050837783], // 北京
      [12695664.306746895, 2578863.9050837783], // 北京
      [12695664.306746895, 2578863.9050837783], // 北京
      [12695664.306746895, 2578863.9050837783], // 北京
      [12695664.306746895, 2578863.9050837783], // 北京
      [12695664.306746895, 2578863.9050837783], // 北京
      [12695664.306746895, 2578863.9050837783] // 北京
    ]
    for (let i = 0, len = condiArr.length; i < len; i++) {
      data.push({
        courtId: '145375415345831' + parseInt(Math.random() * 1000), // 小区ID
        gpsLat: condiArr[i][0], // 纬度
        gpsLon: condiArr[i][1], // 经度
        org: '001002004', // 所属组织
        courtName: '广州恒大', // 小区名字
        regionName: '广东省增城区中新镇', // 小区地址
        houseCount: 100, // 楼栋数
        allPersonNum: 500, // 总人数
        sexProportion: '1:2', // 比例
        outInFrequency: 150 // 出入频率
      })
    }
    return {
      data: data,
      code: '00000',
      message: 'success'
    }
  },
  // 显示某小区信息
  getCourtInfo: config => {
    var data = []
    for (var i = 0; i < 11; i++) {
      data.push({
        gpsLat: 12695662.306746894,
        gpsLon: 2578863.9050837783,
        org: '001002004',
        courtId: '5737834237375345', // 小区ID
        courtName: '广州恒大', // 小区名字
        houseName: 'A栋', // 小区楼栋
        totalHouse: 100, // 小区楼栋总套数
        housePersonNum: 500, // 小区楼栋总人数
        houseSexProportion: '1:2', // 小区楼栋性别比例
        houseOutInFrequency: 150 // 小区楼栋出入频率
      })
    }
    return {
      data: data,
      code: '00000',
      message: 'success'
    }
  }
}
